# RemoveGaps Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberingSchema..::..RemoveGaps Method
NumberingSchema Class See Also
---
Removes gaps, if any, in a numbering sequence
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void RemoveGaps(
	string partition
)
```

Visual Basic
---
```text
Public Sub RemoveGaps ( _
	partition As String _
)
```

Visual C++
---
```text
public:
void RemoveGaps(
	String^ partition
)
```

# ### Parameters
partition
    Type: System..::..String Name of the partition that identifies the sequence. The sequence must exist.
# Remarks
Gaps are removed by shifting numbers above each gap down by the amount of numbers skipped in the gap. The lowest number in the sequence will remain unchanged.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The sequence partition does not exist in the schema. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Either the schema or its document cannot be modified at present. |

# See Also
NumberingSchema Class
Autodesk.Revit.DB Namespace